export const MAIL_TEMPLATES = {
  confirmation: {
    subject: 'Подтверждение регистрации',
    getText: (link: string) => `
      SkillSwap 46-1 Подтвердите вашу почту

      Здравствуйте!

      Благодарим за регистрацию. Чтобы активировать аккаунт, перейдите по ссылке:
      ${link}
      
      Ссылка действительна в течение 24 часов.

      Если вы не регистрировались, просто проигнорируйте это письмо.
    `,
  },

  resetPassword: {
    subject: 'Сброс пароля',
    getText: (link: string) => `
      SkillSwap 46-1 Сброс пароля

      Здравствуйте!

      Мы получили запрос на сброс пароля. Чтобы продолжить, перейдите по ссылке:
      ${link}

      Если вы не запрашивали сброс пароля, просто проигнорируйте это письмо.
    `,
  },
} as const;
